Revit 2027 API
MasonryCMUApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUApplication" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MasonryCMUApplicationType
Public Enumeration MasonryCMUApplicationType
public enum class MasonryCMUApplicationType
type MasonryCMUApplicationType
Members
Member name | Value | Description
Glossy | 0
Matte | 1
Unfinished | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace